use std::io;    //io 是 rust 的标准库，文件读写都需要他，它来自 Rust 的prelude 预读取模块

fn main() {
    println!("Guess Number! 😄");  // ！这个是 Rust 里面的宏，作用是将括号（）里面的文字输出到屏幕上

    println!("Try to GUESS a Number!");

    // let mut foo:i32 = 1;
    // let bar:i32 = foo; //将foo的值绑定到 bar 上 //默认 Rust 里面的所有变量都是“常量“，内部的值是不可变的

    // foo = 2;    //cannot mutate immutable variable `foo`

    let mut guess:String = String::new();//String 会返回一个字符串的新的示例::new() 是 String 的关联函数

    io::stdin().read_line(&mut guess)
    .expect("Cannot Read the line you tapped it");

    /*
        read_line - 获取用户的输入，将用户的输入放到字符串中，这里放到 guess
                    这里的字符串参数必须是可变的，因为每次获取的都是不同的值
        &         - 引用 引用在 rust 中默认也是不可变的，要想可变需要用mut关键字
                    引用在 Rust 中非常关键，因为字符串也会指向内存中的“堆Heap“ ，为了内存安全，
                    这里的需要使用内存中的同一个地址，而不是通过拷贝得到的值
        io::Result - 是一种枚举变体，会返回两个值 OK, Err
        ⚠️注意： 这里建议写上 expect 方法，因为io::Result实际上会输出逻辑真假来判断
                同时建议器也会进行检查
     */

    /*
    也可以这样写：
    std::io::stdin().read_line(&mut guess)
    .expect("Cannot Read the line you tapped it");

     */

    println!("Your guess Number is: 🂷 🎴{}",guess);

}
