fn main() {
    let guess: u32 = "42".parse().expect("Not a number");
    //如果想将一个字符串转换成“数“，就必须为它指明需要转换的类型，不能不指明类型

    //有符号整数类型范围
    // i8-i128 i8 i16 i32 i64 i128

    //无符号数据类型
    //u8-u128 u8 -> 0-255

    //arch -> 程序所运行的硬件架构

    //Byte 仅限于u8类型 b'A'

    //整数的默认类型 i32

    println!("{}", guess);

    //类型推断
    // 即使不设置数据类型，Rust 编译器🧬会自动根据赋值去推断类型
    let x = 2.0;    //f64

    let y = 3.0;    //f32

    let sum = 5 + 10;
    let difference = 95.5 - 4.3;

    let product = 4 * 30;

    let quotient = 56.7 / 32.2;

    let reminder = 54 % 5;

    //Boolean

    let t = true;
    let f:bool = false;

    //character
    let c = 'z';
    let y: char = 'β';
    let z = '😂';

}
